# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

date = '02.11.2013'
date_list = date.split('.')
data_days = {'01': 'первое',
             '02': 'второе',
             '03': 'третье',
             '04': 'четвертое',
             '05': 'пятое',
             '06': 'шестое',
             '07': 'седьмое',
             '8': 'восьмое',
             '9': 'девятое',
             '10': 'десятое',
             '11': 'одиннадцатое',
             '12': 'двенадцатое',
             '13': 'тринадцатое',
             '14': 'четырнадцатое',
             '15': 'пятнадцатое',
             '16': 'шестнадцатое',
             '17': 'семнадцатое',
             '18': 'восемнадцатое',
             '19': 'девятнадцатое',
             '20': 'двадцатое',
             '21': 'двадцать первое',
             '22': 'двадцать второе',
             '23': 'двадцать третье',
             '24': 'двадцать четвертое',
             '25': 'двадцать пятое',
             '26': 'двадцать шестое',
             '27': 'двадцать седьмое',
             '28': 'двадцать восьмое',
             '29': 'двадцать девятое',
             '30': 'тридцатое',
             '31': 'тридцать первое'}
data_months = {'01': 'января',
               '02': 'февраля',
               '03': 'марта',
               '04': 'апреля',
               '05': 'мая',
               '06': 'июня',
               '07': 'июля',
               '08': 'августа',
               '09': 'сентября',
               '10': 'октября',
               '11': 'ноября',
               '12': 'декабря'}
for key in data_days.keys():
    if date_list[0] == key:
        date_list[0] = data_days[key]
for key in data_months.keys():
    if date_list[1] == key:
        date_list[1] = data_months[key]
print(f'{date_list[0]} {date_list[1]} {date_list[2]} года')
